fds/src/test/resources/userProcessMessage.xml

<?xml version='1.0' encoding='UTF-8'?>
<!-- 
  Copyright (c) 2005-2006 Intalio inc.
 
  All rights reserved. This program and the accompanying materials
  are made available under the terms of the Eclipse Public License v1.0
  which accompanies this distribution, and is available at
  http://www.eclipse.org/legal/epl-v10.html
 
  Contributors:
  Intalio inc. - initial API and implementation
 -->

<!-- $Id: userProcessMessage.xml 3302 2006-03-29 13:41:51Z ozenzin $ -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
        <wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://localhost:8081/workflow/forms/examples/absence-request/absence-approval</wsa:To>
        <wsa:ReplyTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
            BF930F2392FDC15C2A113759611707612
        </wsa:MessageID>
    </soapenv:Header>
    <soapenv:Body>
        <ar:createTaskRequest xmlns:ar="http://www.intalio.com/bpms/workflow/forms/examples/absence-request/absence-approval">
            <ar:taskMetaData>
                <!-- Task Meta Data -->
                <ar:userProcessEndpoint>http://localhost:8080/pxe/soap/AbsenceRequest/workflow_To_AbsenceRequest</ar:userProcessEndpoint>
                <ar:userProcessNamespaceURI>http://www.intalio.com/bpms/workflow/forms/examples/absence-request/absence-approval</ar:userProcessNamespaceURI>
            </ar:taskMetaData>
            
            <ar:participantToken>VE9L<!-- ... -->PS0VO</ar:participantToken>
            <ar:taskInput>
                <ar:input >
                   <ar:name>
                       <ar:firstName>Iwan</ar:firstName>
                       <ar:lastName>Memruk</ar:lastName>
                   </ar:name>
                </ar:input>
            </ar:taskInput>
        </ar:createTaskRequest >
    </soapenv:Body>
</soapenv:Envelope>